j20-immigration/j20-immigration.org
#+OPTIONS: broken-links:t todo:nil
#+AUTHOR: Hawaii J20
#+hugo_base_dir: /home/dk/Public/projects/958-web-site/public-node/j20-immigration/
#+hugo_auto_set_lastmod: t
** Doesn't a state sanctuary law contradict federal law?
   :PROPERTIES:
   :EXPORT_FILE_NAME: contradict-fed-law
   :EXPORT_DATE: 2018-06-12
   :EXPORT_AUTHOR: "Hawaii J20"
   :EXPORT_HUGO_MENU: :menu "main"
   :END:

*** Question
Doesn't a state sanctuary law contradict federal law?

*** Answer
Hawaii’s proposed sanctuary state bill does not conflict with federal
law because it allows federal immigration efforts to continue. Constitutional
experts agree that the provisions of Hawaii’s proposed sanctuary state bill are
legal. None of its provisions have been found by any court to be in violation of
federal law or the U.S. Constitution.

