j20-immigration/content/post/contradict-fed-law.md
+++
title = "Doesn't a state sanctuary law contradict federal law?"
author = ["Hawaii J20"]
date = 2018-06-12
lastmod = 2018-06-13T14:11:31-10:00
draft = false
[menu.main]
  weight = 2008
  identifier = "doesn-t-a-state-sanctuary-law-contradict-federal-law"
+++

## Question {#question}

Doesn't a state sanctuary law contradict federal law?


## Answer {#answer}

Hawaii’s proposed sanctuary state bill does not conflict with federal
law because it allows federal immigration efforts to continue. Constitutional
experts agree that the provisions of Hawaii’s proposed sanctuary state bill are
legal. None of its provisions have been found by any court to be in violation of
federal law or the U.S. Constitution.
